---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.SelfIntersectingSpline
source: html/39a93c8c-7528-ed07-8735-a65f5268b0bf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.SelfIntersectingSpline Property

Self intersecting splines are not allowed in sketches.

## Syntax (C#)
```csharp
public static FailureDefinitionId SelfIntersectingSpline { get; }
```